In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [4]:
ser=pd.Series()
ser

Series([], dtype: float64)

In [5]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90])

In [6]:
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [10]:
ser = pd.Series([20,15.5,'10'])
ser

0      20
1    15.5
2      10
dtype: object

In [1]:
dict = {'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [2]:
dict

{'A': [1, 2, 5], 'B': [5, 8, 9], 'C': [1, 2, 3]}

In [8]:
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [12]:
df['states']='CA NV AZ'.split()

In [13]:
df

   A  B  C states
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [17]:
dict={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [15]:
dict

{'A': [1, 2, nan], 'B': [5, nan, nan], 'c': [1, 2, 3]}

In [18]:
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df['D']=[20,30,40]

In [20]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [22]:
print(df.dropna(axis=1))

   C   D
0  1  20
1  2  30
2  3  40

In [24]:
print("\n dropping any column with a nan value\n",'-'*35, sep=' ')
print(df.dropna(axis=1))

 dropping any column with a nan value
 -----------------------------------
   C   D
0  1  20
1  2  30
2  3  40

In [25]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [26]:
print("\n dropping any column with a nan value\n",'-'*35, sep=' ')
print(df.dropna(axis=0))

 dropping any column with a nan value
 -----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [27]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [28]:
print("\n filling values with a default value\n",'-'*35, sep=' ')
print(df.fillna(value=50))

 filling values with a default value
 -----------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  3  40

In [29]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [36]:
df.fillna(value=df['C'].mean(), inplace=True)
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [37]:
data={'company':['google','google','msft','msft','fb','fb'],
     'person':['sam','charlie','amy','vanessa','carl','sarah'],
     'sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  company   person  sales
0  google      sam    200
1  google  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [39]:
bycomp=df.groupby('company')
bycomp

In [40]:
print(bycomp.mean())

         sales
company
fb       296.5
google   160.0
msft     232.0

In [41]:
print(bycomp.sum())

         sales
company
fb         593
google     320
msft       464

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/dsrscientist/dataset1/master/pima_indian_diabetes.csv")

In [4]:
df.head(5)

   6  148  72  35    0  33.6  0.627  50  1
0  1   85  66  29    0  26.6  0.351  31  0
1  8  183  64   0    0  23.3  0.672  32  1
2  1   89  66  23   94  28.1  0.167  21  0
3  0  137  40  35  168  43.1  2.288  33  1
4  5  116  74   0    0  25.6  0.201  30  0